<template>
  <div>
    <br>
    <p class="par">
      שלום רב,
      <br>
ברוכים הבאים למשחק העדפת תמונות.
<br>
המשחק נערך במסגרת פרויקט גמר שמתבצע במחלקה להנדסת תכנה ומערכות מידע.
<br><br>
המשחק מחולק לשני שלבים:
<br><br>
1. עליכם לצפות ב-72 תמונות לפחות ולתת להן ציון שמבטא עד כמה אתם אוהבים את התמונה. שלב זה נמשך כ- 10 דקות. חשוב שתתנו ציונים המשקפים את העדפותיכם כי הצלחתכם במשחק תלויה בכך שבהמשך תצליחו לזהות אילו תמונות אהבתם יותר ואילו תמונות אהבתם פחות 
<br><br>
2. לאחר מכן, אתם מוזמנים לשחק במשחק:  בפניכם יוצג מסך שבו 8 תמונות מתוך התמונות שראיתם בשלב 1. האתגר הוא לבחור מבין התמונות האלו את 2 התמונות להן נתתם את הציונים הגבוהים ביותר בשלב 1. על כל בחירה נכונה תזכו בנקודה. כל משחק כולל ארבעה מסכים כאלו.
<br><br>
מטרת המשחק היא לצבור כמה שיותר נקודות. אנא התאמצו ככל האפשר כדי שתהיה לנו תחרות מעניינת!
<br>
אתם מוזמנים לשחק במשחק פעם אחת בכל יום, במהלך כל התקופה בה יהיה המשחק זמין. לא ניתן לשחק במשחק יותר מפעם ביום.
<br>
כדי לאפשר משחק בהתאם לכללים, וכדי לאפשר קשר אתכם במהלך תקופת המשחק, נבקשכם לציין כתובת של דואר אלקטרוני באמצעותה נוכל לשלוח לכם הודעות (למשל, תזכורת במידה ועברו כמה ימים מאז שיחקתם לאחרונה). מעבר לכך, אין צורך באמצעי הזדהות כלשהו. אם תרצו, אתם יכולים לבחור לעצמכם כינוי שיאפשר לכם לזהות את עצמכם בטבלת השחקנים המצטיינים. 
<br><br>
אנו מתחייבים:
<br><br>
1. לעדכן אתכם לגבי ההישג שלכם במשחק עם סיום תקופת המשחק.
<br><br>
2. שכל הנתונים על המשחק ישמרו על מחשב מאובטח וישמשו אך ורק לניתוחים סטטיסטיים. בשום אופן לא יפורסמו נתונים אישיים לגביכם.
<br><br>
    </p>
    <div class="d-flex justify-content-center">
      <button type="button" class="btn btn-outline-danger" v-on:click="submit">
        אני מסכים/ה להשתתף במשחק העדפת התמונות בהתאם לתנאים שפורטו לעיל
      </button>
    </div>
    <br><br>
  </div>
</template>

<script>

export default {
  name: "HomePage",
  components: {
  },
  methods: {
      submit(){
        this.$router.push("MainPage");
      }
  },
  created() {},
};
</script>
<style scoped>
.par{
 text-align: right;
 margin-right: 5%; 
}
</style>
